#include "Task.h"

//---------------------------------------------------------
// Taskの処理
//---------------------------------------------------------



//---------------------------------------------------------
// コンストラクタ
//---------------------------------------------------------
Task::Task(int taskId)
{
	// IDは引数で貰ったIDに
	this->taskId = taskId;
	// 状態はREADYから開始
	taskState = TASK_STATE::READY;
}

//---------------------------------------------------------
// デストラクタ
//---------------------------------------------------------
Task::~Task()
{

}

//---------------------------------------------------------
// タスクを持ったオブジェクトのIDを取得する関数
//---------------------------------------------------------
int Task::getTaskId()
{
	return taskId;
}

//---------------------------------------------------------
// タスクを持ったオブジェクトの状態を取得する関数
//---------------------------------------------------------
int Task::getTaskState()
{
	return taskState;
}

//---------------------------------------------------------
// タスクを持ったオブジェクトの初回起動時に実行される処理関数
//---------------------------------------------------------
bool Task::activate()
{
	// レディの時だけACTIVEになるように
	if (!(taskState < TASK_STATE::ACTIVE))
	{
		return false;
	}

	// 初回実行時にしてほしい処理内容を呼ぶ
	activateProc();

	// 状態をACTIVE
	taskState = TASK_STATE::ACTIVE;

	return true;
}


//---------------------------------------------------------
// タスクを持ったオブジェクトの死亡時に実行される処理関数
//---------------------------------------------------------
bool Task::deactivate()
{
	// 未満なら何もしない
	if (!(taskState < TASK_STATE::INACTIVE))
	{
		return false;
	}

	// 死亡時にしてほしい処理内容を呼ぶ
	deactiveProc();

	// 状態を死亡状態にする
	taskState = TASK_STATE::INACTIVE;

	return true;
}